//******************************************************************************
//
// StartSymbol  [StartSymbol.h]
// Author  :  SHOHEI MATSUMOTO
// 更新日  :  2015/06/26
//
//******************************************************************************
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "Framework\FrameworkOption.h"
#include "Framework/GameWindow/GameDirectX.h"
#include "Framework/Texture/TextureManagerHolder.h"
#include "StartSymbol.h"
#include "Framework\GameManager\GameManager.h"
#include "Framework\DebugProc\DebugProc.h"

//******************************************************************************
// マクロ定義
//******************************************************************************


//******************************************************************************
// プロトタイプ宣言
//******************************************************************************


//******************************************************************************
// メンバ変数:
//******************************************************************************


//******************************************************************************
// グローバル変数:
//******************************************************************************
namespace {

    const char* kTextureFilename = "data/Texture/push_start.png";

    const DWORD kStartSymbolColor = 0xffffffff;

    const float kChangeAlpha = 0.02f;
}

//******************************************************************************
// 関数定義
//******************************************************************************
//==============================================================================
// コンストラクタ
// 引数    :  無し
// 戻り値  :  無し
// Author  :  SHOHEI MATSUMOTO
// 更新日  :  2015/06/12
//==============================================================================
StartSymbol::StartSymbol(const D3DXVECTOR3 &pos, const float &rot, const D3DXVECTOR2 &size)
    : Object2D(pos, size, kTextureFilename) {
  rot_ = rot;
  color_ = kStartSymbolColor;
  tex_color_ = color_;
  changeAlpha_ = -kChangeAlpha;
}

void StartSymbol::Update(){
  // 透明にしていく
  tex_color_.a += changeAlpha_;
  if (tex_color_.a >= 1.0f || tex_color_.a <= 0.0f){
      changeAlpha_ *= -1;
  }
  SetTexColor(tex_color_);
}

//==============================================================================
// 描画処理
// 引数    :  無し
// 戻り値  :  無し
// Author  :  SHOHEI MATSUMOTO
// 更新日  :  2015/06/12
//==============================================================================
void StartSymbol::_PreProcessOfDraw(void){
}

void StartSymbol::_PostProcessOfDraw(void){
}


// EOF