//******************************************************************************
//
// タイマー処理  [timer.h]
// Author  :  SHOHEI MATSUMOTO
// 更新日  :  2015/06/12
//
//******************************************************************************
//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef _TIMER_H_
#define _TIMER_H_

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "NumberObject.h"

//******************************************************************************
// ライブラリのリンク
//******************************************************************************


//******************************************************************************
// マクロ定義
//******************************************************************************
namespace{
    // 1分
    static const int kOneMinute = 60;
    // 何分か
    static const int kMinuteNum = 10;
    // 何秒か
    static const int kSecondNum = 0;
    // 何進数か
    static const int kFigureDefine = 10;
    // 何桁か
    static const int kMaxFigure = 4;
    // ゲームタイム
    static const int kTimerCount = kMinuteNum * kOneMinute + kSecondNum;
}

//******************************************************************************
// 構造体定義
//******************************************************************************


//******************************************************************************
// クラス定義
//******************************************************************************
class NumberObject;
class Object2D;
class Timer{
  public:
  // modemanaged


  // funciton ==================================
public:
  // ctor
  Timer(const D3DXVECTOR3 &pos, const float &rot, const D3DXVECTOR2 &size, NUMBER_TYPE type);
  // dtor
  virtual ~Timer();
  // update
  void Update();
  // draw
  void Draw(void);
  // reset
  void Reset(void);
  // get
  int GetValue(void){ return value_; }
  // 時間が終了したか
  bool GetEnd(void){ return time_up_; }

protected:

private:


  // parameter =================================
public:

protected:

private:
  int count_;
  int value_;
  NumberObject **p_number_object_;
  Object2D *p_object2D_;
  bool time_up_;
};

//******************************************************************************
// プロトタイプ宣言
//******************************************************************************



#endif
// EOF