//******************************************************************************
//
// SceneTitleFactory  [SceneTitleFactory.h]
// Author  :  SHOHEI MATSUMOTO
// 更新日  :  2015/06/26
//
//******************************************************************************
//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef _SCENETITLEFACTORY_H_
#define _SCENETITLEFACTORY_H_

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "Framework/Scene/SceneFactory.h"

//******************************************************************************
// クラス定義
//******************************************************************************
class SceneTitleFactory : public SceneFactory {
public:
    // ctor/dtor
    SceneTitleFactory();
    virtual ~SceneTitleFactory();

    // method
    Scene* Create(void) override;

private:
    // property
};

#endif
// EOF