//******************************************************************************
//
// SceneResultFactory  [SceneResultFactory.h]
// Author  :  SHOHEI MATSUMOTO
// 更新日  :  2015/06/26
//
//******************************************************************************
//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef _SCENERESULTFACTORY_H_
#define _SCENERESULTFACTORY_H_

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "Framework/Scene/SceneFactory.h"

//******************************************************************************
// クラス定義
//******************************************************************************
class SceneResultFactory : public SceneFactory {
public:
    // ctor/dtor
    SceneResultFactory();
    virtual ~SceneResultFactory();

    // method
    Scene* Create(void) override;

private:
    // property
};

#endif
// EOF